--バックアップとリストア

-- バックアップを取る
--
-- まず、サイドバーから「mydb_byMnaviPHP」を選び、
-- そこから画面上部の「エクスポート(Export)」を選ぶ。

-- 「詳細(Custom)」のラジオボタンを選択し、
-- 「出力(Output)」内「出力をファイルに保存する」をクリックする。

-- そして、「実行(Go)」をクリックすることで、ファイルが保存される。


-- リストアをする（バックアップファイルを使って、復元する)
--
-- サイドバーから家のアイコンをクリックしてホーム画面へ移動、
-- 上部から「データベース」を選択。
-- 壊れたデータベース名と同じ名前を「Database name」内に入れ、
-- 文字コードは「utf8~」に設定して「作成(create)」をクリックしてデータベースを作成。

-- そこから画面上部「インポート」をクリックして、
-- 「アップロードファイル(Browse your computer:)」隣の「ファイルを選択」をクリック＆
-- バックアップファイルを選んでアップロード。

-- これで、バックアップが開封出来るよ！
-- winで使いたい時も安心だね。







-- …って、

-- こ　　れ　　を　　ま　　ず　　先　　に　　言　　わ　　ん　　か　　い　　ッ　　！　　！　　！　　！　　！　　！　　


--
