SQLソフト？「phpMyAdmin」のイカれた用語の復習だぜ！

-- ・データベース
-- パソコンの「フォルダ」のようなもの。
-- 「テーブル」を目的に合わせて分類することが可能。
-- データベースには、「UTF8(utf8mb4_general_ci)」のほか、
-- 「sjis_japanese_ui(「Shift JIS」の場合に使用する)」

-- ・テーブル
-- excelのような「表計算ソフト」のようなもの。
-- 横軸に表の定義を、縦軸に各種情報を書いていくのだ。
-- あらかじめマスが用意されているexcelとは違い、
-- SQLでは定義や表を自分でコードで定義しなければならない。

-- ・カラム設計
-- データを検索したり、集計しやすくする工夫。

-- ・データの挿入
-- 「データベーススペースを作る」→「テーブルを作る」→「データを挿入する」

-- カラムの「型」
-- 「VARCHAR(文字列)」「TINYINT(-128から127までの整数)」「FLOAT(少数つきの数字)」
-- 「DATE(日付)」「DATETIME(日付と時間)」といった型を、
-- 状況に合わせて正しく設定する必要がある。


--
